Revit 2027 API
ExternalDefinitionCreationOptions.Visible Property
 True if the parameter is visible to the user, false if it is hidden and accessible only via the API. The default is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
public:
property bool Visible {
	bool get ();
	void set (bool value);
}
member Visible : bool with get, set
Property Value
Boolean
See Also
Reference
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace